{
  "5e3993b940ff6929a0df6c68": {
    "title": "Verb chaining",
    "tutorial": "<p>Verb chains or verb chaining is when there are two or more verbs in one sentence. When this occurs, only the first verb in the sentence is conjugated in the personal form. The other verbs are in the infinitive form.</p><p>The exception to this rule is with the verbs täytyy and pitää.</p>"
  },
  "5e3994f040ff6929a0df6c9a": {
    "title": "Liking things",
    "tutorial": "<p>Tykätä/Pitää both mean to like. Tykätä is used more in spoken Finnish. </p><h2>With nouns</h2><p>You can use Tykätä/Pitää to express you like something or someone. Just add -sta/-stä to the end of the noun. </p><h2>With verbs</h2><p>To express you like doing something, you use either tykätä or pitää. However, the verb ending will differ depending on the which verb you use. </p><p>Just like there are different ways to express liking to do something in English, there are different ways in Finnish. For example, I like to ski and I like skiing, both mean the same thing. In Finnish though, you only use the infinitive verb form with tykätä. So, I like to ski is tykkään hiihtää.  With pitää, you need to add -misesta/-misestä to the verb root. This then translates to verb-ing. So, pidän hiihtämisestä means, I like skiing. </p><p>But there's more! You can also add -sta/-stä, which changes the verb to a noun. For example, Tykkään hiihdosta and Pidään hiihdosta both mean, I like skiing. So in this context, I like skiing can mean you like to watch people doing it (perhaps at a sporting event, not necessarily as a participant), or as a participant. However, it's not as easy as adding -sta/-stä to the verb root. There is some kind of gnarly mutation between the verb root and -sta/-stä, which I can't currently explain.</p>"
  },
  "5e39953f40ff6929a0df6cb8": {
    "title": "Having something",
    "tutorial": "<p>To express someone or something has something, the verb to have is used. To form the expression, you first state the possessor of the thing, and add the adessive case, lla/llä to the end. So, I minä, becomes my minun, becomes I minulla. Then the 3rd person of the verb olla, to be is used. So, minulla on, means I have. Kissoilla on yhdeksän elämää, cats have nine lives. </p><p>Just like in some other languages, to have is sometimes used instead of the verb to be. So you say, I have hunger, minulla on nälkä, instead of I am hungry. </p><h3>Negative</h3><p>To form the negative (not having something), just replace on with ei ole. So Minulla ei ole lapsia, means I don't have kids. Note, negative objects take the partitive case. </p><h3>Exceptions</h3><p>However not all things (specifically objects) follow this rule. If the possession is part of something, the inessive ssa/ssä is used on the possessor. So for example, Pöydässä on kolme jalkaa, the table has 3 legs, Kiimingissä on 15000 ihmistä, Kiiminki has 15000 inhabitants.</p><h3>Questions</h3><p>To form a question, switch the order of the two parts and add the question suffix to the verb to be. So you have, sinulla on, becomes onko sinulla, do you have. With negative questions, use eikö sinulla ole kissaa?, don't you have a cat?</p>"
  },
  "5e39955740ff6929a0df6cd9": {
    "title": "Tai vs Vai",
    "tutorial": "<p>Both <em>tai</em> and <em>vai</em> mean <em>or</em> in English, but they’re used in different contexts. </p><h3>tai is only used in statements</h3><p>If it's not a question, use <em>tai</em> :)</p><h3>tai and vai are both used in questions.</h3><p>A good analogy to learn this is to think of check-boxes and radio buttons.</p><p><strong>Checkboxes example</strong>. Use <em>tai</em>, if the expected answer might not be in the list of options provided, or may be multiple options in the list of options. </p><p><strong>Radio buttons example</strong>. Use <em>vai</em>, if the expected answer is expected to be in the list of options provided, and only be one answer. </p><p>In some questions, these uses can depend on context though. For example, Voisitko vapaa-ehtoinen kaksi tai kolme päivää viikossa? Could you volunteer 2 or 3 days a week? Means, the amount of days are suggested, and you could also do more or less (probably). In the example, Voisitko vapaa-ehtoinen kaksi vai kolme päivää viikossa? It means, you can volunteer either 2 or 3 days a week. Not 1, or more than 3. Perhaps there is some rule in the organisation. </p><h3>Exceptions (kind of)</h3><p>In the following example, </p><p>Miten voi tilata tai peruuttaa tilauksen? How can I subscribe or unsubscribe? </p><p>You use <em>tai</em> because even thought it's a question, these are not strictly options. Actually, we are asking how we do this and that. </p><p>In another, Miksi planeetat ovat pyöreitä? Miksi ne eivät ole kuution, pyramidin tai levyn muotoisia? Why are planets round? Why aren't they shaped like cubes, pyramids, or discs? </p><p>This again is a question not really offering you a list of options to select from. So <em>tai</em> is used. </p>"
  },
  "123": {
    "title": "Test",
    "tutorial": "<p>Both <em>tai</em> and <em>vai</em> mean <em>or</em> in English, but they’re used in different contexts. </p><h3>tai is only used in statements</h3><p>If it's not a question, use <em>tai</em> :)</p><h3>tai and vai are both used in questions.</h3><p>A good analogy to learn this is to think of check-boxes and radio buttons.</p><p><strong>Checkboxes example</strong>. Use <em>tai</em>, if the expected answer might not be in the list of options provided, or may be multiple options in the list of options. </p><p><strong>Radio buttons example</strong>. Use <em>vai</em>, if the expected answer is expected to be in the list of options provided, and only be one answer. </p><p>In some questions, these uses can depend on context though. For example, Voisitko vapaa-ehtoinen kaksi tai kolme päivää viikossa? Could you volunteer 2 or 3 days a week? Means, the amount of days are suggested, and you could also do more or less (probably). In the example, Voisitko vapaa-ehtoinen kaksi vai kolme päivää viikossa? It means, you can volunteer either 2 or 3 days a week. Not 1, or more than 3. Perhaps there is some rule in the organisation. </p><h3>Exceptions (kind of)</h3><p>In the following example, </p><p>Miten voi tilata tai peruuttaa tilauksen? How can I subscribe or unsubscribe? </p><p>You use <em>tai</em> because even thought it's a question, these are not strictly options. Actually, we are asking how we do this and that.</p>"
  }
}